import pandas as pd

months = ['Jan', 'Feb', 'March', 'April']
sales = {
    'revenue': [100, 200, 300, 400], # словничок
    'items_sold': [23, 43, 54, 65],
    'new_clients': [10, 20, 30, 40] # вектор
}


df = pd.DataFrame(data=sales, index=months) # багатовимірний масив
print(df)

# vector = [1, 2, 3] # у векторі множаться занчення і змінюється довжина вектора
# print(vector * 2) # нП коли потрібно щось дописати, продублювати

# series = pd.Series([1, 2, 3]) # підмножина, одновимірний масив, як один стовпчик; це робота щі стовпчиком
# print(series * 2) # матричне множення, на виході у стовпчик зліва відображаться індекси від 0 до 2, які відповідають множенню на 2 (2,4,6)

# series_str = pd.Series(["a", "b", "c"]) # можемо звертатись до індексів, до змінної, до місця, де виділено місце під цей масивчик, як звичайний списочок
# print(series_str[0])

# months = ['Jan', 'Feb', 'March', 'April']
# sales = [100, 200, 300, 400]
# data = pd.Series(data=sales, index=months) # звертається до стовпчиків та до інесків, до наповненя стопчика, можна брати окремі шматочки = код, який можна обробити; можна зробити два стовпччика и працювати
# print(data) # видає два стовпчика 
# print(data["Feb"]) # видає тільки значення індексу лютого, який дорівнює 200

# print(df.head(2)) # вивід з початку
# print(df.tail(1)) # вивід з кінця

# print(df.revenue)

# print(df.info()) # виводить статистичні дані; викликаємо метод - це дія: мінімальне, максимальне, середнестатистичне значення
# print(df.shape) # повертає кортежем рядки, потім - стовпчики (4, 3) = row, columns; це атрибут, він не виконує дію, а просто зберігає значення (кількість рядків, кількість стовпчиків)
print(df.columns) # виводить назви стовпців 
print(df.describe()) # виводить статистично тільки цифри
print(df.dtypes) # сприймає як обʼєкт, не як числа: dtype: object

df.revenue = pd.to_numeric(df.revenue, errors='coerce') # pd.to_numeric - перетворення в число (int або float). Це корисно, коли стовпець містить числа у вигляді тексту "1000", "2.5". errors='coerce' — примусове перетворення, тобто є такі значення, які неможливо перетворити на число і вони за допомогою цього параметру замінюються на NaN

# print(df.loc['Feb']) # вивело Name: Feb, dtype: int64

print(df.loc[['Feb', 'March']]) # вивело тільки два індекса із стовпчиками

movies_df = pd.read_csv('data/movies_metadata.csv') # pd.read_csv - це функція з бібліотеки pandas, яка читає файл у форматі CSV (comma-separated values) і перетворює його на DataFrame — табличну структуру, подібну до Excel-таблиці: 1.pd.read_csv відкриває файл movies_metadata.csv, який лежить у папці data/; 2.Файл розбирається: заголовки колонок, значення, типи даних тощо; 3.результат завантажується у DataFrame; 4.змінна movies_df тепер містить цю таблицю.
# print(movies_df.to_string()) # видає табличний варіант

# print(pd.options.display.max_rows) # виводить рядки у кількості 60 
pd.options.display.max_rows = 10 # виводить рядки
print(pd.options.display.max_rows) 